<a href="https://colab.research.google.com/github/Prateekbangwal/Applied_AI/blob/main/pandas_basics_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [3]:
import pandas as pd
import numpy as np
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index = labels)
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [6]:
print(df.describe())
print(df.info())

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 720.0+ bytes
None

**3. Print the first 2 rows of the birds dataframe **

In [7]:
print(df.iloc[0:2,:])

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [8]:
print(df[['birds', 'age']])

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [16]:
print(df[['birds', 'age', 'visits']].iloc[[2,3,7]])

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [17]:
df.loc[df['visits']<4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [19]:
df[['birds', 'visits']].loc[df['age'].isnull()]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [23]:
df.loc[(df['birds'] == 'Cranes') & (df['age']<4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [26]:
df.loc[(df['age']>2) &(df['age']<=4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [28]:
df_birds = df.groupby('birds')
df_cranes= df_birds.get_group('Cranes')
df_cranes['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [29]:
df_birds['age'].mean()

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [38]:
new_dict ={
    'birds':'Peacock',
    'age':7,
    'visis':10,
    'priority':'yes'
}
label = ['k']
df1 = pd.DataFrame(new_dict,index=label)
df1
df = df.append(df1)
df
df.drop('k', axis=0,inplace=True)
df

         birds  age  visits priority  visis
0       Cranes  3.5     2.0      yes    NaN
1       Cranes  4.0     4.0      yes    NaN
2      plovers  1.5     3.0       no    NaN
3   spoonbills  NaN     4.0      yes    NaN
4   spoonbills  6.0     3.0       no    NaN
5       Cranes  3.0     4.0       no    NaN
6      plovers  5.5     2.0       no    NaN
7       Cranes  NaN     2.0      yes    NaN
8   spoonbills  8.0     3.0       no    NaN
9   spoonbills  4.0     2.0       no    NaN
10     Peacock  7.0     NaN        1   10.0
11     Peacock  7.0     NaN        1   10.0

**13. Find the number of each type of birds in dataframe (Counts)**

In [36]:
df_birds.size()

birds
Cranes        4
plovers       2
spoonbills    4
dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [37]:
df.sort_values(['age', 'visits'], ascending=[False,True])

         birds  age  visits priority  visis
8   spoonbills  8.0     3.0       no    NaN
10     Peacock  7.0     NaN        1   10.0
11     Peacock  7.0     NaN        1   10.0
4   spoonbills  6.0     3.0       no    NaN
6      plovers  5.5     2.0       no    NaN
9   spoonbills  4.0     2.0       no    NaN
1       Cranes  4.0     4.0      yes    NaN
0       Cranes  3.5     2.0      yes    NaN
5       Cranes  3.0     4.0       no    NaN
2      plovers  1.5     3.0       no    NaN
7       Cranes  NaN     2.0      yes    NaN
3   spoonbills  NaN     4.0      yes    NaN

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [39]:
priority_dict = {"yes":1,'no':0}
df['priority'] = df['priority'].map(priority_dict)
df

         birds  age  visits  priority  visis
0       Cranes  3.5     2.0       1.0    NaN
1       Cranes  4.0     4.0       1.0    NaN
2      plovers  1.5     3.0       0.0    NaN
3   spoonbills  NaN     4.0       1.0    NaN
4   spoonbills  6.0     3.0       0.0    NaN
5       Cranes  3.0     4.0       0.0    NaN
6      plovers  5.5     2.0       0.0    NaN
7       Cranes  NaN     2.0       1.0    NaN
8   spoonbills  8.0     3.0       0.0    NaN
9   spoonbills  4.0     2.0       0.0    NaN
10     Peacock  7.0     NaN       NaN   10.0
11     Peacock  7.0     NaN       NaN   10.0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [40]:
df['birds'] = df['birds'].replace({'Cranes':'trumpeters'})
df

         birds  age  visits  priority  visis
0   trumpeters  3.5     2.0       1.0    NaN
1   trumpeters  4.0     4.0       1.0    NaN
2      plovers  1.5     3.0       0.0    NaN
3   spoonbills  NaN     4.0       1.0    NaN
4   spoonbills  6.0     3.0       0.0    NaN
5   trumpeters  3.0     4.0       0.0    NaN
6      plovers  5.5     2.0       0.0    NaN
7   trumpeters  NaN     2.0       1.0    NaN
8   spoonbills  8.0     3.0       0.0    NaN
9   spoonbills  4.0     2.0       0.0    NaN
10     Peacock  7.0     NaN       NaN   10.0
11     Peacock  7.0     NaN       NaN   10.0